<!DOCTYPE html>
<html>
    <head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width,initial-scale=1,minimum-scale=1">
    <title>C&#43;&#43;虚继承模型解析 - Windog&#39;s Blog</title>

    <style type="text/css">
        img.wp-smiley,
        img.emoji {
            display: inline !important;
            border: none !important;
            box-shadow: none !important;
            height: 1em !important;
            width: 1em !important;
            margin: 0 .07em !important;
            vertical-align: -0.1em !important;
            background: none !important;
            padding: 0 !important;
        }
    </style>
    <link rel='stylesheet' href='https://winfog.github.io/css/style.css' type='text/css' media='all' />
    <link rel='stylesheet' href='https://winfog.github.io/css/custom.css' type='text/css' media='all' />
        
</head>
    <body class="two-column">
        <a href="#content">Skip to content</a>
<div class="wrapper">
    <header role="banner" class="banner widgets columns-1">
        <a href="/" rel="home">
            <h1 class="site">Windog&#39;s Blog</h1>
            <p></p>
        </a>
        <nav role="navigation" aria-label="Primary Navigation">

            <ul class="menu">
                <li class="menu-item "><a class="menu__link" href="/about/">ABOUT</a></li>
            </ul>
            <select onChange="location.href=value;">
                <option value="/about/" class="menu-item menu-item-type-custom menu-item-object-custom" >ABOUT</option>
            </select>
        </nav>
    </header>

    <br>
    <div style="width: 100%; max-height: 100px; text-align: center;">
       
</div>

    <div class="breadcrumbs">
        
    </div>
        <div id="content" class="content">

<main role="main">
    <article role="article" class="post type-post format-standard hentry">
        <header class="post-header">
            <h1>C&#43;&#43;虚继承模型解析</h1>
            <div class="post-details">
                <a rel="bookmark">
                    <time datetime="2016-04-01T41:120:06">2016-04-01</time>
                </a>
				
<span style="float: right;">
    <div id="fb-root" style="height: 100%;"></div>
    
    <script async defer crossorigin="anonymous" src="https://connect.facebook.net/en_US/sdk.js#xfbml=1&version=v3.2"></script>
    
    <div class="fb-share-button" data-href="https://winfog.github.io/c-%E8%99%9A%E7%BB%A7%E6%89%BF%E6%A8%A1%E5%9E%8B%E8%A7%A3%E6%9E%90/" data-layout="button_count" data-size="small">
        <a target="_blank" href="https://www.facebook.com/sharer/sharer.php?u=https%3a%2f%2fwinfog.github.io%2fc-%25E8%2599%259A%25E7%25BB%25A7%25E6%2589%25BF%25E6%25A8%25A1%25E5%259E%258B%25E8%25A7%25A3%25E6%259E%2590%2f" class="fb-xfbml-parse-ignore">Share</a>
    </div>
    &nbsp;
    <a href="https://twitter.com/share?ref_src=twsrc%5Etfw" class="twitter-share-button" data-text="C&#43;&#43;虚继承模型解析" data-url="https://winfog.github.io/c-%E8%99%9A%E7%BB%A7%E6%89%BF%E6%A8%A1%E5%9E%8B%E8%A7%A3%E6%9E%90/" data-show-count="false">Tweet</a>
    <script async src="https://platform.twitter.com/widgets.js" charset="utf-8"></script>
    &nbsp;
    
</span>

            </div>
        </header>

        <div class="post-content">
            

<h1 id="c-虚继承模型解析">C++虚继承模型解析</h1>

<h2 id="前言">前言</h2>

<p>最近在看《深度探索C++对象模型》，对于C++的序继承实现原理的困惑比较严重。书中与自己的实现结果相差比较大，自己就好好研究了一下。</p>

<p>VS的工具集的命令提示提供了工具 cl /d1reportSingleClassLayout 编译选项来查看对象完整的内存布局。</p>

<p>例如：cl entry.cpp /d1reportSingleClassLayoutD 就是列出在entry.cpp中class D的结构。</p>

<p>当然，看完我的吐槽，你一定会觉得C++真是辣鸡。</p>

<h2 id="为什么使用虚继承">为什么使用虚继承</h2>

<p>C++的虚继承是为了解决多重继承产生的同源问题，最明显的例子就是所谓的钻石型继承：</p>

<pre><code class="language-c++">  A
 / \
B   C
 \ /
  D

</code></pre>

<p>B与C同时继承了A，D又继承了B,C。我们知道，在C++对象模型里，基类与子类是在同一个对象空间里的。那么这样从D向B，C看，都会看到A类。换句话说，在一个对象空间里有二个相同的A类。为了解决这种同源问题，我们引入虚继承：</p>

<pre><code class="language-c++">class A { public: void Foo() {} };
class B : public virtual A {};
class C : public virtual A {};
class D : public B, public C {};
</code></pre>

<p>这样，在class D 的对象模型中只存在一个class A 的副本了。</p>

<h2 id="对象模型">对象模型</h2>

<p>我们从不考虑虚函数的单一继承入手，因为有虚函数的情况更为复杂：</p>

<pre><code class="language-c++">class A
{
    public: int a;
};
class B :virtual public A
{
    public:int b;
};
</code></pre>

<p>这样sizeof(B) = 12; 除了变量a与b所占的8字节空间，还多了4字节，我们看一下class B的结构：</p>

<pre><code class="language-c++">class B size(12):
-------+----------
 0      | {vbptr}
 4      | b
-------+---------
-------+--- (virtual base A)
 8      | a
-------+---------
</code></pre>

<p>可见，前4个字节被一个叫做vbptr东西给占据了，通过名字判断，很明显，这是一个指针。罗列一下这个指针所指向的内容：</p>

<pre><code class="language-c++">B::$vbtable@:
-------+----------
 0      | 0
 1      | 8 (Bd(B+0)A)
-------+---------
</code></pre>

<p>它指向了2个分别为0，8的东西。分别表示了在这个类的对象空间中，继承类与基类相对于这个vbptr的偏移。也就是说B的内容偏移为0，A的内容偏移为8。</p>

<p>了解了单继承，看看多继承是什么样的：</p>

<pre><code class="language-c++">class A
{
public: int a;
 };
class B
{
public:int b;
 };
class C :virtual  public A,virtual  public B
{
public:int c;
};
</code></pre>

<p>sizeof&copy; = 16，多了4字节的_vbptr，有了单继承的经验，我们可以推断vbptr 的内容：</p>

<pre><code class="language-c++">C::$vbtable@:
-------+----------
 0      | 0
 1      | 8 (Cd(C+0)A)
 2      | 12 (Cd(C+0)B)
-------+----------
</code></pre>

<h2 id="加入虚函数">加入虚函数</h2>

<p>现在，我们在上面的单继承中加入虚函数，我们知道虚函数需要一个虚函数表维护动态调用，这个机制在虚继承下有所改变。</p>

<p>例子1：</p>

<pre><code class="language-c++">class A
{
public: int a;
    virtual void Foo() {}
};
class B :virtual public A
{
public:int b;
        virtual void Foo(){}
};
sizeof(B) = 16;
</code></pre>

<p>class结构：</p>

<pre><code class="language-c++">class B size(16):
-------+----------
 0      | {vbptr}
 4      | b
-------+----------
-------+----------(virtual base A)
 8      | {vfptr}
12      | a
-------+----------

B::$vbtable@:
-------+----------
 0      | 0
 1      | 8 (Bd(B+0)A)
-------+----------
</code></pre>

<p>例子2：</p>

<pre><code class="language-c++">class A
{
public: int a;
    virtual void Foo() {}
};
class B :virtual public A
{
public:int b;
       virtual void Bar(){}
};
sizeof(B) = 20;
</code></pre>

<p>class结构：</p>

<pre><code class="language-c++">class B size(20):
-------+----------
 0      | {vfptr}
 4      | {vbptr}
 8      | b
-------+----------
-------+----------(virtual base A)
12      | {vfptr}
16      | a
-------+----------

B::$vbtable@:
-------+----------
 0      | -4
 1      | 8 (Bd(B+4)A)
-------+----------
</code></pre>

<p>interesting 不是吗？这二个例子告诉我们很多很多，先从大小说起。可以看到，只是虚函数改了一个名字，继承类部分就多了一个虚表。这个告诉我们，在虚继承中，同名虚函数还是通过虚表覆盖这个方式进行调用的，而非同名函数则另外建立一个自己的虚表。并且，基类在对象空间中有自己的虚表，可以从结构中看见在例一中的虚表属于基类。</p>

<p>再观察二者的vbptr部分，虚表的位置在vbptr之前，所以例二的vbtable的第一个元素是-4。</p>

<p>接着就是多重继承：</p>

<pre><code class="language-c++">class A
{
public: int a;
        virtual void Foo() {}
};
class B 
{
public:int b;
       virtual void Foo(){}
};
class C :virtual  public A, virtual  public B
{
public:int c;
       virtual void Foo(){}
};
sizeof(C) = 24，不用多说，应该可以知道由 3个int大小，二个虚表，一个vbptr组成。

</code></pre>

<p>好的，基本概念我们有了，那么我们开始提到，虚继承是为了解决同源问题，所以我们必须继续分析钻石形继承的问题。</p>

<pre><code class="language-c++">class A
{
public: int a;
        virtual void Foo() {}
};
class B :virtual  public A
{
public:int b;
       virtual void Foo(){}
};
class C :virtual  public A
{
public:int c;
       virtual void Foo(){}
};
class D :public B, public C
{
public:
    int d;
    virtual void Foo(){}
    virtual void Bar(){}
};
sizeof(D) = 32。
</code></pre>

<p>class对象结构：</p>

<pre><code class="language-c++">class D size(32):
-------+----------
 0      | {vfptr}
-------+----------(base class B)
 4      | | {vbptr}
 8      | | b
-------+----------
-------+----------(base class C)
12      | | {vbptr}
16      | | c
-------+----------
20      | d
-------+----------
-------+----------(virtual base A)
24      | {vfptr}
28      | a
-------+----------
</code></pre>

<p>其中需要关注的就是：这个对象模型中只有一个class A的副本，也就是说只有一份int a与A的虚表。由于D是直接继承class C与class D的，所以他们的副本被直接”拷贝”进了对象空间所以这里会有2份vbptr。之前说过了，由于B,C中没有与A非同名的虚函数，所以他们没有自己的独立虚表，这也是为什么base A中的虚表只有一份。</p>

<h2 id="调用方式">调用方式</h2>

<p>知道了虚继承的对象模型，接下来我们需要研究在代码中实际的调用方式，这种方式实际上是隐藏在编译器内部的。</p>

<p>还是以最基础的没有虚函数的对象为例：</p>

<pre><code class="language-c++">class Base
{
public:int a;
};
class Derived :virtual public Base
{
public:int b;
};
int main()
{
    Derived xx;
    xx.a = 1;            //    &lt;-------这一句应该怎样调用？
    return 0;
}
</code></pre>

<p>在一般继承中这种赋值直接调用即可,汇编：</p>

<p>mov dword ptr [xx],1</p>

<p>但是虚继承让这个问题变得复杂起来了，这个没有虚表的虚继承对象模型结构是这样的：</p>

<pre><code class="language-c++"> 0      | {vbptr}
 4      | b
-------+--- (virtual base Base)
 8      | a
</code></pre>

<p>或许你说，既然这样，我们直接对里面的变量a偏移赋值就行了吧，理论上来说，在这个模型里似乎没什么问题。但是别忘了我们虚继承为了解决的主要问题：钻石继承。钻石虚继承需要实现的核心是在最底下的继承类D中只存在一个A的副本：</p>

<pre><code class="language-c++">  A
 / \
B   C
 \ /
  D
</code></pre>

<p>所以，我说所以，虽然我不知道为什么VS把虚基类放在对象模型的最后，但是，他既然这样做了，就会产生许多问题：我们有时必须去确定虚基类之前的大小，例如这样：</p>

<pre><code class="language-c++">class Base
{
public:int a;
};
class Derived : virtual public Base
{
public:int b;
};
int main()
{
    Base *a;
    Derived xx;
    a = &amp;xx;
    printf(&quot;%x, %x&quot;, a, &amp;xx);
    return 0;
}
</code></pre>

<p>看这个printf，从代码上看a与xx指向同一个东西，但是，我说但是，这TM是虚继承，Base类在对象模型的后部而不是一般继承的头部，这让我们在一般C语言的指针操作改变了，编译器必须想办法去算出base在这个对象模型中的偏移，重新计算指针位置。看一下程序的输出结果：</p>

<p>e4f978, e4f970</p>

<p>回去看一下开始所示的一般类型的虚继承模型，Base类的位置就是源地址加8。</p>

<p>好，现在是不是觉得十分糟糕，对，我发现的时候也这样觉得。</p>

<p>接着，我们可以猜一下，为什么会有这种糟糕的设计了。参见深度探索C++对象模型这本书的内容。</p>

<p>虚继承的对象模型核心问题：存取共享部分。这书有这样一句话：不变局部中的数据，不管后继如何演化总是有固定的偏移；共享的局部数据，位置会因为每次派生操作而变化。还是以那个钻石继承为例：</p>

<pre><code class="language-c++">class A
{
public: int a;
};
class B :virtual  public A
{
public:int b;
};
class C :virtual  public A
{
public:int c;
};
class D :public B, public C
{
public: int d;
};
</code></pre>

<p>你觉得在class D中应该怎样布局？可以是这样：</p>

<pre><code class="language-c++">a        class A
b        class B
c        class C
d        class D
</code></pre>

<p>但是，这样布局有一种情况比较难处理：D d; C *c = d;无论将哪一个地址给c都不会有一个比较恰当的位置，所以VS使用了这种存储偏移值的方式。</p>

<p>回到正题，如何调用，说了这么多应该明白了吧。就是通过存储的偏移值找到需要的基类地址：</p>

<pre><code class="language-c++">int main()
{
    D xx;
    xx.a = 1;    //    &lt;------怎么调用基类元素？
    return 0;
}
</code></pre>

<p>上面说的很重要，这里再说一遍：不变局部中的数据，不管后继如何演化总是有固定的偏移；共享的局部数据，位置会因为每次派生操作而变化。</p>

<p>在这个钻石型继承中，不变的局部数据指的就是B,C,D中的内容，这部分内容直接通过偏移访问。共享的数据明显就是A的内容，需要计算偏移。</p>

<p>看一下这里怎样计算偏移，汇编代码：</p>

<pre><code class="language-asm">mov         eax,dword ptr [xx]  
mov         ecx,dword ptr [eax+4]  
mov         dword ptr xx[ecx],1
</code></pre>

<p>用伪代码表示就是：</p>

<pre><code class="language-asm">eax = vbptr·    //xx的第一个元素你是vbptr
ecx = vbptr.second     //vbptr的第二个元素
xx[ecx] = 1       //通过获得的偏移赋值
</code></pre>

<h2 id="结束">结束</h2>

<p>我在也不想管虚继承的破事了。实际上草草结尾，还有很多问题没有讨论，哎C++大坑啊。</p>

<p>~ by 旧世界拯救&ndash;1</p>

        </div>

        <footer class="post-footer">
            

            
            <span class="post-tags">
                
                <a href="https://winfog.github.io/tags/c&#43;&#43;" rel="tag">C&#43;&#43;</a>&emsp;
                
                <a href="https://winfog.github.io/tags/%E6%97%A7%E4%B8%96%E7%95%8C" rel="tag">旧世界</a>&emsp;
                
            </span>
            
        </footer>
        
<table cellspacing="15" style="width:100%; border: none;">
    <tr>
        <td style="text-align: center; border: none; padding: 0px;">
        </td>
        <td style="text-align: center; border: none; padding: 0px;">
        </td>
    </tr>
</table>

        
	
	

    </article>

    
    <nav class="navigation post-navigation" role="navigation">
        <div class="nav-links">
            <div class="nav-previous">
                
            </div>
            <div class="nav-next">
                
                <a class="next" href="https://winfog.github.io/hugo-%E5%B8%B8%E7%94%A8%E6%93%8D%E4%BD%9C%E7%AC%94%E8%AE%B0/"> Hugo 常用操作笔记</a>
                
            </div>
        </div>
    </nav>
    <section>
        
    </section>
    

</main>


        <div class="sidebar1 widgets columns-1">

    <aside>
    
</aside>
    <aside class="widget widget_categories">
        <h2>Categories</h2>
        <ul class="widget__list">
        </ul>
    </aside>

    <aside class="widget widget_tag_cloud">
        <h2>Tags</h2>
        <div class="tagcloud"><a class="tag-cloud-link" href="/tags/c&#43;&#43;" title="c&#43;&#43;" style="font-size: 12pt;">C&#43;&#43;</a>&emsp;<a class="tag-cloud-link" href="/tags/%e6%97%a7%e4%b8%96%e7%95%8c" title="旧世界" style="font-size: 12pt;">旧世界</a>&emsp;
        </div>
    </aside>

    <aside class="widget widget_recent_entries">
        <h2>Recent Posts</h2>
        <ul>
            <li>
                <a href="/hugo-%E5%B8%B8%E7%94%A8%E6%93%8D%E4%BD%9C%E7%AC%94%E8%AE%B0/">Hugo 常用操作笔记</a>
            </li>
            <li>
                <a href="/c-%E8%99%9A%E7%BB%A7%E6%89%BF%E6%A8%A1%E5%9E%8B%E8%A7%A3%E6%9E%90/">C&#43;&#43;虚继承模型解析</a>
            </li>
        </ul>
    </aside>

    <aside class="widget widget_archive">
        <h2>Archives</h2>
        <ul><li><a href="/archives/2016/04">2016/04 (1)</a></li>
        </ul>
    </aside>

</div>
        </div>
        </div>
<footer role="contentinfo" class="document-footer contentinfo widgets columns-1">

    <aside class="widget widget_text">
        <div class="textwidget">
            <p>© Windog&#39;s Blog / Powered by <a href="https://gohugo.io" target="_blank">Hugo</a> with theme <a href="https://github.com/tosi29/inkblotty" target="_blank">Inkblotty</a></p>
        </div>
    </aside>
</footer>
</div>

    </body>
</html>
